Ran Plan for dir: `Project_1` workspace: `default`

<details><summary>Show Output</summary>

```diff
[0m[1mInitializing modules...[0m
- bucket_creation in ../modules/Buckets
- service_account_creation in ../modules/Service Account
- vm_creation in ../modules/VM
- vpc_creation in ../modules/VPC

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/google versions matching "6.40.0"...
- Installing hashicorp/google v6.40.0...
- Installed hashicorp/google v6.40.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

[0m[1mmodule.vm_creation[0].google_compute_disk.extra_disk["gcloud-vm-using-atlantis-p1"]: Refreshing state... [id=projects/terraform-gcp-463406/zones/asia-southeast1-a/disks/gcloud-vm-using-atlantis-p1-extra-disk][0m
[0m[1mmodule.vm_creation[0].google_compute_instance.vm1["gcloud-vm-using-atlantis-p1"]: Refreshing state... [id=projects/terraform-gcp-463406/zones/asia-southeast1-a/instances/gcloud-vm-using-atlantis-p1][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # module.vm_creation[0].google_compute_disk.extra_disk["gcloud-vm-using-atlantis-p1"][0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "google_compute_disk" "extra_disk" {
        [1m[0mid[0m[0m                             = "projects/terraform-gcp-463406/zones/asia-southeast1-a/disks/gcloud-vm-using-atlantis-p1-extra-disk"
      [33m~[0m [0m[1m[0mlast_attach_timestamp[0m[0m          = "2025-07-07T21:39:24.518-07:00" [33m->[0m [0m"2025-07-07T21:45:53.506-07:00"
        [1m[0mname[0m[0m                           = "gcloud-vm-using-atlantis-p1-extra-disk"
      [33m~[0m [0m[1m[0musers[0m[0m                          = [
          [32m+[0m [0m"https://www.googleapis.com/compute/v1/projects/terraform-gcp-463406/zones/asia-southeast1-a/instances/gcloud-vm-using-atlantis-p1",
        ]
        [90m# (18 unchanged attributes hidden)[0m[0m
    }
[1m  # module.vm_creation[0].google_compute_instance.vm1["gcloud-vm-using-atlantis-p1"][0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "google_compute_instance" "vm1" {
        [1m[0mid[0m[0m                        = "projects/terraform-gcp-463406/zones/asia-southeast1-a/instances/gcloud-vm-using-atlantis-p1"
      [32m+[0m [0m[1m[0mlabels[0m[0m                    = {}
        [1m[0mname[0m[0m                      = "gcloud-vm-using-atlantis-p1"
      [32m+[0m [0m[1m[0mresource_policies[0m[0m         = []
        [1m[0mtags[0m[0m                      = [
            "http-server",
            "https-server",
            "ssh",
        ]
        [90m# (18 unchanged attributes hidden)[0m[0m


      [33m~[0m [0mboot_disk {
            [90m# (6 unchanged attributes hidden)[0m[0m

          [33m~[0m [0minitialize_params {
              [32m+[0m [0m[1m[0mresource_manager_tags[0m[0m       = {}
                [90m# (9 unchanged attributes hidden)[0m[0m
            }
        }



        [90m# (4 unchanged blocks hidden)[0m[0m
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
  [31m-[0m destroy
[0m
Terraform will perform the following actions:

[1m  # module.vm_creation[0].google_compute_disk.extra_disk["gcloud-vm-using-atlantis-p1"][0m will be [1m[31mdestroyed[0m[0m
[0m  [31m-[0m[0m resource "google_compute_disk" "extra_disk" {
      [31m-[0m [0m[1m[0mcreate_snapshot_before_destroy[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcreation_timestamp[0m[0m             = "2025-07-07T03:27:24.664-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdisk_id[0m[0m                        = "8744070787952418787" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0meffective_labels[0m[0m               = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_confidential_compute[0m[0m    = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                             = "projects/terraform-gcp-463406/zones/asia-southeast1-a/disks/gcloud-vm-using-atlantis-p1-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabel_fingerprint[0m[0m              = "vezUS-42LLM=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabels[0m[0m                         = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlast_attach_timestamp[0m[0m          = "2025-07-07T21:45:53.506-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlast_detach_timestamp[0m[0m          = "2025-07-07T21:44:53.863-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlicenses[0m[0m                       = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m                           = "gcloud-vm-using-atlantis-p1-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mphysical_block_size_bytes[0m[0m      = 4096 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m                        = "terraform-gcp-463406" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mprovisioned_iops[0m[0m               = 0 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mprovisioned_throughput[0m[0m         = 0 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m                      = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-463406/zones/asia-southeast1-a/disks/gcloud-vm-using-atlantis-p1-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msize[0m[0m                           = 50 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mterraform_labels[0m[0m               = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtype[0m[0m                           = "pd-standard" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0musers[0m[0m                          = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/terraform-gcp-463406/zones/asia-southeast1-a/instances/gcloud-vm-using-atlantis-p1",
        ] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mzone[0m[0m                           = "asia-southeast1-a" [90m->[0m [0m[90mnull[0m[0m
    }

[1m  # module.vm_creation[0].google_compute_disk.extra_disk["gcloud-vm2-using-atlantis-p1"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_disk" "extra_disk" {
      [32m+[0m [0m[1m[0maccess_mode[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcreate_snapshot_before_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mdisk_id[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0meffective_labels[0m[0m               = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mlast_attach_timestamp[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlast_detach_timestamp[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlicenses[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                           = "gcloud-vm2-using-atlantis-p1-extra-disk"
      [32m+[0m [0m[1m[0mphysical_block_size_bytes[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                        = "terraform-gcp-463406"
      [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0msize[0m[0m                           = 50
      [32m+[0m [0m[1m[0msource_disk_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0msource_image_id[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msource_instant_snapshot_id[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0msource_snapshot_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mterraform_labels[0m[0m               = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mtype[0m[0m                           = "pd-standard"
      [32m+[0m [0m[1m[0musers[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                           = "asia-southeast1-a"

      [32m+[0m [0mguest_os_features {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)
        }
    }

[1m  # module.vm_creation[0].google_compute_instance.vm1["gcloud-vm-using-atlantis-p1"][0m will be [1m[31mdestroyed[0m[0m
[0m  [31m-[0m[0m resource "google_compute_instance" "vm1" {
      [31m-[0m [0m[1m[0mallow_stopping_for_update[0m[0m = true [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcan_ip_forward[0m[0m            = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcpu_platform[0m[0m              = "Intel Broadwell" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcreation_timestamp[0m[0m        = "2025-07-07T21:45:52.238-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcurrent_status[0m[0m            = "RUNNING" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdeletion_protection[0m[0m       = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0meffective_labels[0m[0m          = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_display[0m[0m            = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                        = "projects/terraform-gcp-463406/zones/asia-southeast1-a/instances/gcloud-vm-using-atlantis-p1" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0minstance_id[0m[0m               = "4397068674670861456" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabel_fingerprint[0m[0m         = "vezUS-42LLM=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabels[0m[0m                    = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmachine_type[0m[0m              = "e2-standard-4" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmetadata[0m[0m                  = {
          [31m-[0m [0m"ssh-keys" = <<-EOT
                yashwanthm:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDCJUnEXVij0etERGHebfRZ/hFgPkC89tSJvm/3O50SAbeMfcucyhKKDZiNlsVSM6N1dwzlM12EWq2ESW2ZyEdrLwbJclu6FCz6WGxRJXUSSIFoxpbJTp2xKbJxLlze9nsWUJ1IAY1UnHXH7oDY5aKimK7P+ixRZ0vOY24WgfmypU6nmWZNZ5kLQoVmK3xeJ+oLkMTSab6Si3XRDHBWAnLnlbKSxxMClDcmlE2AIU7TcUw0bMWm/F4mis0cICWuR/Z4rsW2iEAkv655mwK4NOsxiC0nUJnOaBjMA5FZwg+zA0xOGus1OR09OBtWGBruzcMRHyx0nCzmfwQKKo8fjEUpTDM+XCBi06cElhqlfIkaTcVo/hlWGktHnYheSgg8MaEsNrp2UrL7JE9rMaYrm87v4QhzRbwzTTuiQEPKLNm91S289QozKCB7CmvWbGdt0W5Jm+LvSc+J4XRGJMjNmcKOj0LANjrQ5IftzIa4sAAxm1BFhh6eT52GQKb7I80Ui2k= yashwanthm@Yashwanths-MacBook-Pro-2.local
            EOT
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmetadata_fingerprint[0m[0m      = "U2rimlLUpA8=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m                      = "gcloud-vm-using-atlantis-p1" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m                   = "terraform-gcp-463406" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mresource_policies[0m[0m         = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m                 = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-463406/zones/asia-southeast1-a/instances/gcloud-vm-using-atlantis-p1" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m                      = [
          [31m-[0m [0m"http-server",
          [31m-[0m [0m"https-server",
          [31m-[0m [0m"ssh",
        ] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_fingerprint[0m[0m          = "xEi19su0rvw=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mterraform_labels[0m[0m          = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mzone[0m[0m                      = "asia-southeast1-a" [90m->[0m [0m[90mnull[0m[0m

      [31m-[0m [0mattached_disk {
          [31m-[0m [0m[1m[0mdevice_name[0m[0m  = "extra-disk" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mforce_attach[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmode[0m[0m         = "READ_WRITE" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0msource[0m[0m       = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-463406/zones/asia-southeast1-a/disks/gcloud-vm-using-atlantis-p1-extra-disk" [90m->[0m [0m[90mnull[0m[0m
        }

      [31m-[0m [0mboot_disk {
          [31m-[0m [0m[1m[0mauto_delete[0m[0m       = true [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mdevice_name[0m[0m       = "persistent-disk-0" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mforce_attach[0m[0m      = false [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mguest_os_features[0m[0m = [
              [31m-[0m [0m"UEFI_COMPATIBLE",
              [31m-[0m [0m"VIRTIO_SCSI_MULTIQUEUE",
              [31m-[0m [0m"GVNIC",
              [31m-[0m [0m"SEV_CAPABLE",
              [31m-[0m [0m"SEV_SNP_CAPABLE",
              [31m-[0m [0m"SEV_LIVE_MIGRATABLE",
              [31m-[0m [0m"SEV_LIVE_MIGRATABLE_V2",
              [31m-[0m [0m"IDPF",
              [31m-[0m [0m"TDX_CAPABLE",
            ] [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmode[0m[0m              = "READ_WRITE" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0msource[0m[0m            = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-463406/zones/asia-southeast1-a/disks/gcloud-vm-using-atlantis-p1" [90m->[0m [0m[90mnull[0m[0m

          [31m-[0m [0minitialize_params {
              [31m-[0m [0m[1m[0marchitecture[0m[0m                = "X86_64" [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0menable_confidential_compute[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mimage[0m[0m                       = "https://www.googleapis.com/compute/v1/projects/rocky-linux-cloud/global/images/rocky-linux-9-v20250611" [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mlabels[0m[0m                      = {} [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mprovisioned_iops[0m[0m            = 0 [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mprovisioned_throughput[0m[0m      = 0 [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mresource_manager_tags[0m[0m       = {} [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mresource_policies[0m[0m           = [] [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0msize[0m[0m                        = 20 [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mtype[0m[0m                        = "pd-standard" [90m->[0m [0m[90mnull[0m[0m
            }
        }

      [31m-[0m [0mnetwork_interface {
          [31m-[0m [0m[1m[0minternal_ipv6_prefix_length[0m[0m = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mname[0m[0m                        = "nic0" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mnetwork[0m[0m                     = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-463406/global/networks/default" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mnetwork_ip[0m[0m                  = "10.148.15.222" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mqueue_count[0m[0m                 = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mstack_type[0m[0m                  = "IPV4_ONLY" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0msubnetwork[0m[0m                  = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-463406/regions/asia-southeast1/subnetworks/default" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0msubnetwork_project[0m[0m          = "terraform-gcp-463406" [90m->[0m [0m[90mnull[0m[0m

          [31m-[0m [0maccess_config {
              [31m-[0m [0m[1m[0mnat_ip[0m[0m       = "35.240.174.73" [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mnetwork_tier[0m[0m = "PREMIUM" [90m->[0m [0m[90mnull[0m[0m
            }
        }

      [31m-[0m [0mscheduling {
          [31m-[0m [0m[1m[0mautomatic_restart[0m[0m   = true [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mavailability_domain[0m[0m = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmin_node_cpus[0m[0m       = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mon_host_maintenance[0m[0m = "MIGRATE" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mpreemptible[0m[0m         = false [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mprovisioning_model[0m[0m  = "STANDARD" [90m->[0m [0m[90mnull[0m[0m
        }

      [31m-[0m [0mshielded_instance_config {
          [31m-[0m [0m[1m[0menable_integrity_monitoring[0m[0m = true [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0menable_secure_boot[0m[0m          = false [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0menable_vtpm[0m[0m                 = true [90m->[0m [0m[90mnull[0m[0m
        }
    }

[1m  # module.vm_creation[0].google_compute_instance.vm1["gcloud-vm2-using-atlantis-p1"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_instance" "vm1" {
      [32m+[0m [0m[1m[0mallow_stopping_for_update[0m[0m = true
      [32m+[0m [0m[1m[0mcan_ip_forward[0m[0m            = false
      [32m+[0m [0m[1m[0mcpu_platform[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mcurrent_status[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m       = false
      [32m+[0m [0m[1m[0meffective_labels[0m[0m          = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0minstance_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mmachine_type[0m[0m              = "e2-standard-4"
      [32m+[0m [0m[1m[0mmetadata[0m[0m                  = {
          [32m+[0m [0m"ssh-keys" = <<-EOT
                yashwanthm:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDCJUnEXVij0etERGHebfRZ/hFgPkC89tSJvm/3O50SAbeMfcucyhKKDZiNlsVSM6N1dwzlM12EWq2ESW2ZyEdrLwbJclu6FCz6WGxRJXUSSIFoxpbJTp2xKbJxLlze9nsWUJ1IAY1UnHXH7oDY5aKimK7P+ixRZ0vOY24WgfmypU6nmWZNZ5kLQoVmK3xeJ+oLkMTSab6Si3XRDHBWAnLnlbKSxxMClDcmlE2AIU7TcUw0bMWm/F4mis0cICWuR/Z4rsW2iEAkv655mwK4NOsxiC0nUJnOaBjMA5FZwg+zA0xOGus1OR09OBtWGBruzcMRHyx0nCzmfwQKKo8fjEUpTDM+XCBi06cElhqlfIkaTcVo/hlWGktHnYheSgg8MaEsNrp2UrL7JE9rMaYrm87v4QhzRbwzTTuiQEPKLNm91S289QozKCB7CmvWbGdt0W5Jm+LvSc+J4XRGJMjNmcKOj0LANjrQ5IftzIa4sAAxm1BFhh6eT52GQKb7I80Ui2k= yashwanthm@Yashwanths-MacBook-Pro-2.local
            EOT
        }
      [32m+[0m [0m[1m[0mmetadata_fingerprint[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                      = "gcloud-vm2-using-atlantis-p1"
      [32m+[0m [0m[1m[0mproject[0m[0m                   = "terraform-gcp-463406"
      [32m+[0m [0m[1m[0mself_link[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                      = [
          [32m+[0m [0m"http-server",
          [32m+[0m [0m"https-server",
          [32m+[0m [0m"ssh",
        ]
      [32m+[0m [0m[1m[0mtags_fingerprint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mterraform_labels[0m[0m          = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mzone[0m[0m                      = "asia-southeast1-a"

      [32m+[0m [0mattached_disk {
          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = "extra-disk"
          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"
          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)
        }

      [32m+[0m [0mboot_disk {
          [32m+[0m [0m[1m[0mauto_delete[0m[0m                = true
          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mguest_os_features[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"
          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)

          [32m+[0m [0minitialize_params {
              [32m+[0m [0m[1m[0marchitecture[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mimage[0m[0m                  = "ubuntu-os-cloud/ubuntu-2204-lts"
              [32m+[0m [0m[1m[0mlabels[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mresource_policies[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0msize[0m[0m                   = 20
              [32m+[0m [0m[1m[0msnapshot[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mtype[0m[0m                   = (known after apply)
            }
        }

      [32m+[0m [0mconfidential_instance_config {
          [32m+[0m [0m[1m[0mconfidential_instance_type[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)
        }

      [32m+[0m [0mguest_accelerator {
          [32m+[0m [0m[1m[0mcount[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m  = (known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0minternal_ipv6_prefix_length[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mipv6_address[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mnetwork[0m[0m                     = "default"
          [32m+[0m [0m[1m[0mnetwork_attachment[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_ip[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mstack_type[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork_project[0m[0m          = (known after apply)

          [32m+[0m [0maccess_config {
              [32m+[0m [0m[1m[0mnat_ip[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mnetwork_tier[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mreservation_affinity {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)

          [32m+[0m [0mspecific_reservation {
              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mscheduling {
          [32m+[0m [0m[1m[0mautomatic_restart[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mavailability_domain[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0minstance_termination_action[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmin_node_cpus[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mon_host_maintenance[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mprovisioning_model[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mtermination_time[0m[0m            = (known after apply)

          [32m+[0m [0mlocal_ssd_recovery_timeout {
              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mmax_run_duration {
              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mnode_affinities {
              [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)
            }

          [32m+[0m [0mon_instance_stop_action {
              [32m+[0m [0m[1m[0mdiscard_local_ssd[0m[0m = (known after apply)
            }
        }
    }

[0m[1mPlan:[0m 2 to add, 0 to change, 2 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [33m~[0m [0m[1m[0mvm_info[0m[0m = {
      [31m-[0m [0mgcloud-vm-using-atlantis-p1  = {
          [31m-[0m [0mip       = "35.240.174.73"
          [31m-[0m [0musername = "yashwanthm"
        } [90m->[0m [0m[90mnull[0m[0m
      [32m+[0m [0mgcloud-vm2-using-atlantis-p1 = {
          [32m+[0m [0mip       = (known after apply)
          [32m+[0m [0musername = "yashwanthm"
        }
    }
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d Project_1`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ed89bf4e3050:4141/lock?id=yashwanthm998%252Fatlantis%252FProject_1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d Project_1`
</details>


---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
